Revit 2026 API

# TextNoteOptionsHorizontalAlignment Property

---

Horizontal alignment of the text.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public HorizontalTextAlignment HorizontalAlignment { get; set; }
```
```vb
Public Property HorizontalAlignment As HorizontalTextAlignment
	Get
	Set
```
```cpp
public:
property HorizontalTextAlignment HorizontalAlignment {
	HorizontalTextAlignment get ();
	void set (HorizontalTextAlignment value);
}
```
```fsharp
member HorizontalAlignment : HorizontalTextAlignment with get, set
```

#### Property Value

HorizontalTextAlignment

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

Default is Left alignment.

#### Reference

TextNoteOptions Class

Autodesk.Revit.DB Namespace